fdr/src/test/resources/requests/nodoChiediStatoRPT.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ws="http://ws.pagamenti.telematici.gov/">
    <soapenv:Header/>
    <soapenv:Body>
        <ws:nodoChiediStatoRPT>
            <identificativoIntermediarioPA>{brokerPa}</identificativoIntermediarioPA>
            <identificativoStazioneIntermediarioPA>{station}</identificativoStazioneIntermediarioPA>
            <password>{stationPwd}</password>
            <identificativoDominio>{pa}</identificativoDominio>
            <identificativoUnivocoVersamento>{iuv}</identificativoUnivocoVersamento>
            <codiceContestoPagamento>{ccp}</codiceContestoPagamento>
        </ws:nodoChiediStatoRPT>
    </soapenv:Body>
</soapenv:Envelope>
