app/soapserver/nodoInviaRPTRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ppt="http://ws.pagamenti.telematici.gov/ppthead" xmlns:ws="http://ws.pagamenti.telematici.gov/">
   <soapenv:Header>
      <ppt:intestazionePPT soapenv:actor="?" soapenv:mustUnderstand="?">
         <identificativoIntermediarioPA>97735020584</identificativoIntermediarioPA>
         <identificativoStazioneIntermediarioPA>97735020584_01</identificativoStazioneIntermediarioPA>
         <identificativoDominio>77777777777</identificativoDominio>
         <identificativoUnivocoVersamento>12345</identificativoUnivocoVersamento>
         <codiceContestoPagamento>?</codiceContestoPagamento>
      </ppt:intestazionePPT>
   </soapenv:Header>
   <soapenv:Body>
      <ws:nodoInviaRPT>
         <password>TestECTE01</password>
         <identificativoPSP>?</identificativoPSP>
         <!--Optional:-->
         <identificativoIntermediarioPSP></identificativoIntermediarioPSP>
         <!--Optional:-->
         <identificativoCanale>?</identificativoCanale>
         <tipoFirma>0</tipoFirma>
	 <rpt>CiAgICAKICAgIAogICAgCiAgICAKICAgIAogICAgCiAgICAKICAgIAo=</rpt>
</ws:nodoInviaRPT>
   </soapenv:Body>
</soapenv:Envelope>
